---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.SegmentIsTooShort
source: html/436e0452-d460-2c85-2d83-e65ac9677602.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.SegmentIsTooShort Property

The segment is too short.

## Syntax (C#)
```csharp
public static FailureDefinitionId SegmentIsTooShort { get; }
```